app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"
---
    def index
      @sorted_movies = params[:sort]
      @movies = Movie.all.order(@sorted_movies)